tutorials/cavitatingFoam/nozzle2D/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          rho;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue; //inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }

    outlet
    {
        type            zeroGradient; //inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }

    wall      
    {
        type            zeroGradient;
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
