tutorials/cavitatingFoam/nozzle2D/0/rho
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          gamma;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -3 0 0 0];

internalField   uniform 828.23621;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 832.75441;
        //value           uniform 828.7118;
    }

    outlet
    {
        type            fixedValue; //inletOutlet;
        value           uniform 828.23621;
        inletValue      uniform 828.23621;
    }

    wall      
    {
        type            zeroGradient;
    }

    back
    {
        type            wedge;
    }

    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
